In [1]:
import pandas as pd

In [27]:
df = pd.read_csv('chipotle.tsv', sep='\t')
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [28]:
prices = [float(value[1 : -1]) for value in df.item_price]
#prices1 = df.item_price.str.replace('$','')
#prices2 = df.item_price.apply(lambda x: x.replace('$',''))
#prices3 = df.item_price.apply(lambda x: x.strip('$'))
df.item_price = prices
df_filtered = df.drop_duplicates(['item_name','quantity'])
df_one_prod = df_filtered[df_filtered.quantity == 1]

df_one_prod[df_one_prod['item_price']>10].item_name.nunique()

12

In [31]:
df_one_prod[['item_name','item_price']].head()

                               item_name  item_price
0           Chips and Fresh Tomato Salsa        2.39
1                                   Izze        3.39
2                       Nantucket Nectar        3.39
3  Chips and Tomatillo-Green Chili Salsa        2.39
5                           Chicken Bowl       10.98

In [41]:
#df_one_prod.item_name.sort_values().head()
df.sort_values(by = "item_name").head()

      order_id  quantity          item_name choice_description  item_price
3389      1360         2  6 Pack Soft Drink        [Diet Coke]       12.98
341        148         1  6 Pack Soft Drink        [Diet Coke]        6.49
1849       749         1  6 Pack Soft Drink             [Coke]        6.49
1860       754         1  6 Pack Soft Drink        [Diet Coke]        6.49
2713      1076         1  6 Pack Soft Drink             [Coke]        6.49

In [45]:
df.sort_values(by='item_price', ascending=False).quantity.head(1)

3598    15
Name: quantity, dtype: int64

In [50]:
df[df.item_name == 'Veggie Salad Bowl'].quantity.sum()

18

In [53]:
df[(df.item_name == 'Canned Soda') & (df.quantity > 1)].quantity.count()

20